Revit 2027 API
PipePressureDropData.PressureDrop Property
 The pressure drop of the pipe. Units: (kg/(ft·s²)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PressureDrop { get; set; }
Public Property PressureDrop As Double
	Get
	Set
public:
property double PressureDrop {
	double get ();
	void set (double value);
}
member PressureDrop : float with get, set
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace